yuplus/nxp-mcx-series/MCXE247/drivers/fsl_ftm.c
            /* Update the mode and edge level */
            base->CONTROLS[chnlParams->chnlNumber].CnSC = reg;

            base->CONTROLS[chnlParams->chnlNumber].CnV = chnlParams->dutyValue;
#if defined(FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT) && (FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT)
            /* Set to output mode */
            FTM_SetPwmOutputEnable(base, chnlParams->chnlNumber, true);
#endif
        }
        else
        {
            /* This check is added for combined mode as the channel number should be the pair number */
            if (((uint32_t)chnlParams->chnlNumber) >= (((uint32_t)FSL_FEATURE_FTM_CHANNEL_COUNTn(base)) / 2U))
            {
                return kStatus_Fail;
            }

            if (mode == kFTM_EdgeAlignedCombinedPwm)
            {
                cnvFirstEdge = 0;
            }
            else if (mode == kFTM_CenterAlignedCombinedPwm)
            {
                cnvFirstEdge = (mod - chnlParams->dutyValue) / 2U;
            }
            else
            {
                /* Return error if requested value is greater than the mod */
                if (chnlParams->firstEdgeValue > mod)
                {
                    return kStatus_Fail;
                }
                cnvFirstEdge = chnlParams->firstEdgeValue;
            }

            /* Re-configure first edge when 0% duty cycle */
            if (chnlParams->dutyValue == 0U)
            {
                /* Signal stays low */
                cnvFirstEdge = 0;
            }

            /* Clear the current mode and edge level bits for channel n */
            reg = base->CONTROLS[((uint32_t)chnlParams->chnlNumber) * 2U].CnSC;
            reg &= ~(FTM_CnSC_MSA_MASK | FTM_CnSC_MSB_MASK | FTM_CnSC_ELSA_MASK | FTM_CnSC_ELSB_MASK);

            /* Setup the active level for channel n */
            reg |= (uint32_t)chnlParams->level << FTM_CnSC_ELSA_SHIFT;

            /* Update the mode and edge level for channel n */
            base->CONTROLS[((uint32_t)chnlParams->chnlNumber) * 2U].CnSC = reg;

            /* Clear the current mode and edge level bits for channel n + 1 */
            reg = base->CONTROLS[(((uint32_t)chnlParams->chnlNumber) * 2U) + 1U].CnSC;
            reg &= ~(FTM_CnSC_MSA_MASK | FTM_CnSC_MSB_MASK | FTM_CnSC_ELSA_MASK | FTM_CnSC_ELSB_MASK);

            /* Setup the active level for channel n + 1 */
            reg |= (uint32_t)chnlParams->level << FTM_CnSC_ELSA_SHIFT;

            /* Update the mode and edge level for channel n + 1*/
            base->CONTROLS[(((uint32_t)chnlParams->chnlNumber) * 2U) + 1U].CnSC = reg;

            /* Set the combine bit for the channel pair */
            base->COMBINE |=
                (1UL << (FTM_COMBINE_COMBINE0_SHIFT + (FTM_COMBINE_COMBINE1_SHIFT * (uint32_t)chnlParams->chnlNumber)));

            /* Set the channel pair values */
            base->CONTROLS[((uint32_t)chnlParams->chnlNumber) * 2U].CnV        = cnvFirstEdge;
            base->CONTROLS[(((uint32_t)chnlParams->chnlNumber) * 2U) + 1U].CnV = cnvFirstEdge + chnlParams->dutyValue;

#if defined(FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT) && (FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT)
            /* Set to output mode */
            FTM_SetPwmOutputEnable(base, (ftm_chnl_t)(uint8_t)((uint8_t)chnlParams->chnlNumber * 2U), true);
            FTM_SetPwmOutputEnable(base, (ftm_chnl_t)(uint8_t)((uint8_t)chnlParams->chnlNumber * 2U + 1U), true);
#endif /* FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT */

            /* Enable/Disable complementary output on the channel pair */
            FTM_SetComplementaryEnable(base, chnlParams->chnlNumber, chnlParams->enableComplementary);
            /* Enable/Disable Deadtime insertion on the channel pair */
            FTM_SetDeadTimeEnable(base, chnlParams->chnlNumber, chnlParams->enableDeadtime);
        }
        chnlParams++;
    }

    return kStatus_Success;
}

/*!
 * brief Configure FTM edge aligned PWM or center aligned PWM by each channel.
 * 
 * This function configure PWM signal by setting channel n value register. Should invoke
 * FTM_SetInitialModuloValue to configure FTM period first. Invoke FTM_SetChannelMatchValue
 * to update PWM duty cycle.
 *
 * param base           FTM peripheral base address
 * param chnlParams     PWM configuration structure pointer.
 * param chnlPairNumber Channel number.
 */
void FTM_ConfigSinglePWM(FTM_Type *base,
                         const ftm_chnl_param_t *chnlParams,
                         ftm_chnl_t chnlNumber)
{
    uint32_t reg;

    assert((chnlParams->mode == kFTM_EdgeAlignedPwm) || (chnlParams->mode == kFTM_CenterAlignedPwm));
    assert(FSL_FEATURE_FTM_CHANNEL_COUNTn(base) != -1);
    assert(chnlNumber < FSL_FEATURE_FTM_CHANNEL_COUNTn(base));

    if (chnlParams->mode == kFTM_CenterAlignedPwm)
    {
        base->SC |= FTM_SC_CPWMS_MASK;
    }
    else
    {
        base->SC &= ~FTM_SC_CPWMS_MASK;
    }

    /* Clear the current mode and edge level bits */
    reg = base->CONTROLS[chnlNumber].CnSC;
    reg &= ~(FTM_CnSC_MSA_MASK | FTM_CnSC_MSB_MASK | FTM_CnSC_ELSA_MASK | FTM_CnSC_ELSB_MASK);

    /* Setup the active level */
    reg |= (uint32_t)chnlParams->level << FTM_CnSC_ELSA_SHIFT;

    /* Edge-aligned mode needs MSB to be 1, don't care for Center-aligned mode */
    reg |= FTM_CnSC_MSB(1U);

#if defined(FSL_FEATURE_FTM_HAS_TRIGGER_MODE) && (FSL_FEATURE_FTM_HAS_TRIGGER_MODE)
    reg = (chnlParams->enablePulseOutput) ? (reg | FTM_CnSC_TRIGMODE_MASK) :
                                            (reg & ~FTM_CnSC_TRIGMODE_MASK);
#endif  /* FSL_FEATURE_FTM_HAS_TRIGGER_MODE */
    /* Update the mode and edge level */
    base->CONTROLS[chnlNumber].CnSC = reg;

#if (defined(FSL_FEATURE_FTM_HAS_DITHERING) && FSL_FEATURE_FTM_HAS_DITHERING)
    if ((FSL_FEATURE_FTM_INSTANCE_HAS_DITHERINGn(base) == 1) && (chnlParams->enableDithering == true))
    {
        base->CV_MIRROR[chnlNumber] = FTM_CV_MIRROR_VAL(chnlParams->chnlValue) |
                                      FTM_CV_MIRROR_FRACVAL(chnlParams->chnlFracValue);
    }
    else
#endif
    {
        base->CONTROLS[chnlNumber].CnV = chnlParams->chnlValue;
    }

