yuplus/nxp-mcx-series/MCXE247/drivers/fsl_ftm.c
#if defined(FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT) && (FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT)
    /* Set to output mode */
    FTM_SetPwmOutputEnable(base, chnlNumber, true);
#endif  /* FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT */
}

/*!
 * brief Configure FTM Combine PWM, Modified Combine PWM or Asymmetrical PWM by each channel pair.
 * 
 * This function configure PWM signal by setting channel n and n+1 value register. Should invoke
 * FTM_SetInitialModuloValue to configure FTM period first. Invoke FTM_SetChannelMatchValue to
 * update PWM duty cycle.
 *
 * param base           FTM peripheral base address
 * param chnlParams     PWM configuration structure pointer.
 * param chnlPairNumber Channel pair number, options are 0, 1, 2, 3.
 */
void FTM_ConfigCombinePWM(FTM_Type *base,
                          const ftm_chnl_param_t *chnlParams,
                          ftm_chnl_t chnlPairNumber)
{
    uint32_t reg;

    assert((chnlParams->mode != kFTM_EdgeAlignedPwm) && (chnlParams->mode != kFTM_CenterAlignedPwm));
    assert(FSL_FEATURE_FTM_CHANNEL_COUNTn(base) != -1);
    assert(chnlPairNumber < FSL_FEATURE_FTM_CHANNEL_COUNTn(base) / 2);

    /* Clear Center-Aligned PWM Select for FTM */
    base->SC &= ~FTM_SC_CPWMS_MASK;

    /* Clear the current mode and edge level bits for channel n */
    reg = base->CONTROLS[((uint32_t)chnlPairNumber) * 2U].CnSC;
    reg &= ~(FTM_CnSC_MSA_MASK | FTM_CnSC_MSB_MASK | FTM_CnSC_ELSA_MASK | FTM_CnSC_ELSB_MASK);

    /* Setup the active level for channel n */
    reg |= (uint32_t)chnlParams->level << FTM_CnSC_ELSA_SHIFT;

    /* Update the mode and edge level for channel n */
    base->CONTROLS[(uint32_t)chnlPairNumber * 2U].CnSC = reg;

    /* Clear the current mode and edge level bits for channel n + 1 */
    reg = base->CONTROLS[((uint32_t)chnlPairNumber * 2U) + 1U].CnSC;
    reg &= ~(FTM_CnSC_MSA_MASK | FTM_CnSC_MSB_MASK | FTM_CnSC_ELSA_MASK | FTM_CnSC_ELSB_MASK);

    /* Setup the active level for channel n + 1 */
    reg |= (uint32_t)chnlParams->level << FTM_CnSC_ELSA_SHIFT;

    /* Update the mode and edge level for channel n + 1 */
    base->CONTROLS[((uint32_t)chnlPairNumber * 2U) + 1U].CnSC = reg;

    /* Set the combine bit for the channel pair */
    base->COMBINE |= (1UL << (FTM_COMBINE_COMBINE0_SHIFT + (FTM_COMBINE_COMBINE1_SHIFT * (uint32_t)chnlPairNumber)));

#if (defined(FSL_FEATURE_FTM_HAS_MODIFIED_COMBINE_PWM) && FSL_FEATURE_FTM_HAS_MODIFIED_COMBINE_PWM)
    if (chnlParams->mode == kFTM_ModifiedCombinedPwm)
    {
        /* Set the modified combine bit for the channel pair */
        base->COMBINE |= 
            (1UL << (FTM_COMBINE_MCOMBINE0_SHIFT + (FTM_COMBINE_COMBINE1_SHIFT * (uint32_t)chnlPairNumber)));
    }
#endif  /* FSL_FEATURE_FTM_HAS_MODIFIED_COMBINE_PWM */

    /* Set the channel pair values */
#if (defined(FSL_FEATURE_FTM_HAS_DITHERING) && FSL_FEATURE_FTM_HAS_DITHERING)
    if ((FSL_FEATURE_FTM_INSTANCE_HAS_DITHERINGn(base) == 1) && (chnlParams->enableDithering == true))
    {
        base->CV_MIRROR[(uint32_t)chnlPairNumber * 2U] = FTM_CV_MIRROR_VAL(chnlParams->chnlValue) |
            FTM_CV_MIRROR_FRACVAL(chnlParams->chnlFracValue);
        base->CV_MIRROR[((uint32_t)chnlPairNumber * 2U) + 1U] = FTM_CV_MIRROR_VAL(chnlParams->combinedChnlValue) |
            FTM_CV_MIRROR_FRACVAL(chnlParams->combinedChnlFracValue);
    }
    else
#endif
    {
        base->CONTROLS[(uint32_t)chnlPairNumber * 2U].CnV        = chnlParams->chnlValue;
        base->CONTROLS[((uint32_t)chnlPairNumber * 2U) + 1U].CnV = chnlParams->combinedChnlValue;
    }

    /* Enable/Disable complementary output on the channel pair */
    FTM_SetComplementaryEnable(base, chnlPairNumber, chnlParams->enableComplementary);
    /* Enable/Disable Deadtime insertion on the channel pair */
    FTM_SetDeadTimeEnable(base, chnlPairNumber, chnlParams->enableDeadtime);

#if defined(FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT) && (FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT)
    /* Set to output mode */
    FTM_SetPwmOutputEnable(base, (ftm_chnl_t)(uint8_t)((uint8_t)chnlPairNumber * 2U), true);
    FTM_SetPwmOutputEnable(base, (ftm_chnl_t)(uint8_t)((uint8_t)chnlPairNumber * 2U + 1U), true);
#endif  /* FSL_FEATURE_FTM_HAS_ENABLE_PWM_OUTPUT */
}

/*!
 * brief Enables capturing an input signal on the channel using the function parameters.
 *
 * When the edge specified in the captureMode argument occurs on the channel, the FTM counter is
 * captured into the CnV register. The user has to read the CnV register separately to get this
 * value. The filter function is disabled if the filterVal argument passed in is 0. The filter
 * function is available only for channels 0, 1, 2, 3.
 *
 * param base        FTM peripheral base address
 * param chnlNumber  The channel number
 * param captureMode Specifies which edge to capture
 * param filterValue Filter value, specify 0 to disable filter. Available only for channels 0-3.
 */
void FTM_SetupInputCapture(FTM_Type *base,
                           ftm_chnl_t chnlNumber,
                           ftm_input_capture_edge_t captureMode,
                           uint32_t filterValue)
{
    uint32_t reg;

    /* Clear the combine bit for the channel pair */
    base->COMBINE &=
        ~(1UL << (FTM_COMBINE_COMBINE0_SHIFT + (FTM_COMBINE_COMBINE1_SHIFT * ((uint32_t)chnlNumber >> 1))));
    /* Clear the dual edge capture mode because it's it's higher priority */
    base->COMBINE &=
        ~(1UL << (FTM_COMBINE_DECAPEN0_SHIFT + (FTM_COMBINE_COMBINE1_SHIFT * ((uint32_t)chnlNumber >> 1))));
#if !(defined(FSL_FEATURE_FTM_HAS_NO_QDCTRL) && FSL_FEATURE_FTM_HAS_NO_QDCTRL)
#if defined(FSL_FEATURE_FTM_INSTANCE_HAS_QUAD_DECODEn)
    if (FSL_FEATURE_FTM_INSTANCE_HAS_QUAD_DECODEn(base) == 1)
    {
        base->QDCTRL &= ~FTM_QDCTRL_QUADEN_MASK;
    }
#else
    /* Clear the quadrature decoder mode beacause it's higher priority */
    base->QDCTRL &= ~FTM_QDCTRL_QUADEN_MASK;
#endif
#endif

    reg = base->CONTROLS[chnlNumber].CnSC;
    reg &= ~(FTM_CnSC_MSA_MASK | FTM_CnSC_MSB_MASK | FTM_CnSC_ELSA_MASK | FTM_CnSC_ELSB_MASK);
    reg |= (uint32_t)captureMode;

